<a href="https://colab.research.google.com/github/JD950/Python_notebook/blob/main/Py_Pandas_DataFrames_9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import datetime

## DataFrames

In [2]:
students = ['Alice', 'Bob', 'Emily', 'Charlie']

In [3]:
scores = [90, 80, 65, 50]

In [6]:
age = [12, 13, 11, 12]

In [8]:
exam_results = pd.DataFrame(
    {
        "name": students,
        "age": age,
        "scores": scores
    }
)

In [9]:
exam_results

      name  age  scores
0    Alice   12      90
1      Bob   13      80
2    Emily   11      65
3  Charlie   12      50

### Searching (SQL SELECT)

In [10]:
exam_results.loc[0, 'scores'] # location-> rowid, column_NAME(s)

90

In [11]:
exam_results.loc[:, 'scores']

0    90
1    80
2    65
3    50
Name: scores, dtype: int64

In [12]:
exam_results.loc[2, :]

name      Emily
age          11
scores       65
Name: 2, dtype: object

In [13]:
exam_results['scores']

0    90
1    80
2    65
3    50
Name: scores, dtype: int64

In [16]:
exam_results[['name', 'age']]
# on DataFrame->  filtering happens on COLUMN LEVEL

      name  age
0    Alice   12
1      Bob   13
2    Emily   11
3  Charlie   12

### Add Columns

We can also easily add columns

In [17]:
gender = ['female', 'male', 'female', 'male']

In [40]:
exam_results['gender'] = gender
# Creates a new dataframe with a new column called Gender

In [39]:
exam_results['gender']

0    female
1      male
2    female
3      male
Name: gender, dtype: object

## Remove Columns

In [41]:
exam_results.drop('age', axis=1) #drops the age column 

# axis=1 means column wise
# axis=0 means row wise 

# 0 means index (flows through rows), 1 is for [column_names]

      name  scores  gender
0    Alice      90  female
1      Bob      80    male
2    Emily      65  female
3  Charlie      50    male

### Column names and Row Index

In [25]:
exam_results.columns
#axis=1

Index(['name', 'age', 'scores', 'gender'], dtype='object')

In [26]:
exam_results.index
#axis=0

RangeIndex(start=0, stop=4, step=1)

### Renaming Columns

In [42]:
exam_results.rename({'name': 'first_name'}, axis=1)

  first_name  age  scores  gender
0      Alice   12      90  female
1        Bob   13      80    male
2      Emily   11      65  female
3    Charlie   12      50    male

### Dealing with missing values

Dataframes have specific commands which help with the handling of missing data

In [43]:
sparse = pd.DataFrame({'a': [1, 2, 3],
                       'b': [np.nan, 4, np.nan],
                       'c': [5, np.nan, np.nan]})

In [44]:
sparse

   a    b    c
0  1  NaN  5.0
1  2  4.0  NaN
2  3  NaN  NaN

In [45]:
sparse.isna()

       a      b      c
0  False   True  False
1  False  False   True
2  False   True   True

In [47]:
sparse.fillna(0) # fill those null values with 0

   a    b    c
0  1  0.0  5.0
1  2  4.0  0.0
2  3  0.0  0.0

In [48]:
sparse.dropna(axis=1) # axis=1 means column level dropping

   a
0  1
1  2
2  3

In [49]:
sparse = pd.DataFrame({'a': [1, 2, 3],
                       'b': [np.nan, 4, np.nan],
                       'c': [5, np.nan, np.nan]})

sparse.fillna(0)
sparse.dropna() # axis=0-> row wise!
# everything dropped-> each row contained at least 1 null value!

Empty DataFrame
Columns: [a, b, c]
Index: []

### Group by

In [57]:
x1= exam_results.drop('age', axis=1)
x1.groupby('gender').mean()

# Like SQL made but a lot easier!
# SQL: Select mean(*) from exam_results group by gender;

        scores
gender
female    77.5
male      65.0

In [66]:
mylist = [1,2,1,2]

exam_results.groupby(mylist).get_group(1)

    name  age  scores  gender
0  Alice   12      90  female
2  Emily   11      65  female

In [67]:
exam_results.groupby(mylist).get_group(2)

      name  age  scores gender
1      Bob   13      80   male
3  Charlie   12      50   male

Thus, suppose we want to group people who obtained marks above or below 70, then we could do:

In [68]:
above_70 = exam_results['scores'] > 70
above_70

0     True
1     True
2    False
3    False
Name: scores, dtype: bool

This will compute the mean scores of students who scored above or below 70

In [69]:
exam_results.groupby(above_70).mean()

         age  scores
scores
False   11.5    57.5
True    12.5    85.0

### Merge and Joining

In [74]:
exam_results

      name  age  scores  gender
0    Alice   12      90  female
1      Bob   13      80    male
2    Emily   11      65  female
3  Charlie   12      50    male

In [78]:
contacts = pd.DataFrame (
    {
        'name' : ['Alice', 'Charlie', 'Emily'],
        'tel'  : ['+44 1234 5678', '+44 3245 5564', '+44 3245 5556' ]
    }
)

In [79]:
exam_results.merge(contacts, left_on='name', right_on='name')   
# defaults to inner join
# inner join-> Set INTERSECTION

      name  age  scores  gender            tel
0    Alice   12      90  female  +44 1234 5678
1    Emily   11      65  female  +44 3245 5556
2  Charlie   12      50    male  +44 3245 5564

In [82]:
exam_results.merge(contacts, left_on='name', right_on='name', how='outer')
# Null values for Bob and Emily because on outer join, no data present!
# outer join-> Set Union

      name  age  scores  gender            tel
0    Alice   12      90  female  +44 1234 5678
1      Bob   13      80    male            NaN
2    Emily   11      65  female  +44 3245 5556
3  Charlie   12      50    male  +44 3245 5564